
export const badStr = [
    "诛仙",
    "宣传",
    "国际",
    "广告",
    "http",
    ".com",
    "QQ",
    "职业",
    ".us",
    "zhuxian",
    "白嫖",
    "五代",
    "完美",
    "公益",
    "仿官",
    "微变",
    "超变",
    "网址",
    "耐玩",
    "法服",
    "官服",
];


/**
 * 腰带可用的蕴灵符
 */
export const beltStone=[311000,311001]

/**
 * 一键十连蕴灵凭证
 */
export const ok10UpgradeItem=340058


/**
 * 一星Boss
 */
export const star1Boss=[
    632,//蛙王
    633,//悍匪
    634,//神火教长老
    635,//金刚
    636,//神火魔祖
    637,//巨熊妖
    638,//噬血恶僧
    639,//骷髅将军
    640,//渔人蛛
    641,//海盗船长
    642,//犀甲之王
    643,//死泽鱼妖
    644,//万虫之母
    645,//死泽厉鬼
    647,//血狮
    648,//玄冥幽鬼
    681,//洪荒兽王
    5596,//鱼人王
    5597,//巫族长老
    10491,//不死天尸
    10492,//八荒火龙
]

export const star2Boss=[
    10669,//昆仑奴
    10670,//法莲王
    10671,//归蝶王
    10672,//天忍王
    10673,//魔獒
    10674,//樱木王
    10675,//阴阳王
    10676,//风火王
    10677,//安土王
    10678,//玄天上将
    10679,//浑沌
    10680,//开明兽
    11563,//冰姹玄女
    13575,//金铃夫人
    13576,//黑心老人
    13578,//万剑一
    13579,//普智
]

export const star3Boss=[
    22106,//邪恶先锋·涛
    22107,//邪恶先锋·凯
    22251,//背叛者·瞳
    22252,//背叛者·娟
    22253,//背叛者·宇
    35236,//冥界·天狼
    35238,//冥界·血狮
    35239,//冥界·古猿
    35240,//冥界·玄鸟
    35241,//冥界·圣使
    35242,//冥界·饕餮
    35243,//冥界·兽神
]

export const star4Boss=[
    400019,//镜·朱颜
    400020,//花·绛妃
    400021,//水·鲤仙
    400022,//月·素娥
    400023,//空·铠鬼
]

export const star5Boss=[
    66999,//烛龙·九阴
    400041,//灵魄·盘古
    400042,//灵魄·女娲
    400043,//混蛋·黑心老G
]

export const star6Boss=[
    400046,//鸿钧神猴·无支祁
    400047,//混沌主宰
    400048,//异界守护者
]

export const starWeek8Boss=[
    400002,//万霆
    400003,//川壅
    400005,//月神·望舒
    400044,//蚩尤
    400045,//魔尊
]
